["If you roundhouse kick Chuck Norris, Chuck Norris will say: \"Congratulations. You are my Roundhouse Kick buddy!\" If i were a Roundhouse Kick Buddy i would go crazy! XD","Chuck Norris is really just a manifestation of Pennywise The Clown's fear.","Chuck Norris once hit a home run with a grand piano.","It is said that looking into Chuck Norris' eyes will reveal your future. Unfortunately, everybody's future is always the same: death by a roundhouse-kick to the face.","Chuck Norris can make his world class Texas chili in your gramdmother's old Crotch Slot","Someone once tried to tell Chuck Norris that roundhouse kicks aren't the best way to kick someone. This has been recorded by historians as the worst mistake anyone has ever made.","Chuck Norris views the Ironman Triathlon as \"a nice cool-down.\"","Of course Chuck Norris is banging Sarah Palin.","Chuck Norris was breifly considered for the next Batman movie, but after test shoots, it became clear that it's impossible to film the batroundhouse kick and survive.","Chuck Norris once gave Mike Tyson a black eye.","Chuck Norris once roundhouse kicked a horse in the face, its descendants are now called the giraffe","For the extra added kick to his homemade Texas Chili, Chuck Norris adds a 1/2 cup of Y.pestis infected rat turds as seasoning.","Confucius say: Wise man never stand infront of bull, never stand behind mule, never stand infront or behind Chuck Norris.","The police routinely question Chuck Norris just because they find him interesting.","Chuck Norris is allowed to say \"ni\" to The Knights Who Say Ni.","They gave Chuck Norris the lethal injection and he caught a buzz","Chuck Norris likes to ride shotgun while driving alone, so he can put his feet up and check his stocks, play some guitar and have a good laugh when he gets pulled over and the cop has to fine thin air.","Chuck Norris thinks Holden Caulfield is a phoney.","Chuck Norris solved the illegal immigration problem. He replaced every \"U.S. Border\" sign with \"Norris Ranch\".","Wanna know what Bill Murray whispered into Scarlett Johanson's ear at the end of Lost In Translation? \"I don't love you, I love Chuck Norris.\"","CHUCK NORRIS IS NOT A LEGEND ...","Chuck Norris burst the dot com bubble.","In honor of Chuck Norris, all McDonald's in Texas have an even larger size than the super-size. When ordering, just ask to be Chucksized.","Chuck Norris is who the lead singer of The Divynals thinks about when she touches herself.","Jack Links Beef Jerky wanted to film a series of \"Messin' with Chuck Norris\" commercials. They later had to settle for Sasquatch because they couldn't find any actors dumb enough to mess with Chuck Norris.","Chuck Norris knows what you did last winter.","It's said that, when this website gets to Fact #9001, Chuck Norris will kick it in the URL, rocketing it up to 10,000 facts.","Chuck Norris doesnt flush the toilet he scares the shit out of it","There is no such thing as a Chuck Norris joke, only facts.","Chuck Norris' favorite cereal is Kellogg's Nails 'N' Gravel.","Chuck Norris skis up the Matterhorn and Mt. Everest.","Chuck Norris once cut a man into two equal diametrically opposing sections by giving him a wedgie.","If you get home from work and find Chuck Norris banging your wife, you should just go ahead and make a sandwich because Chuck Norris gets hungry after sex!","Chuck Norris roundhouse kicked a man in a wheelchair in the ground people dug that fossil up it is now a handicap parking sign but really it is a warning that Chuck is coming","The most beautiful and lush chord ever heard by the human ear is created by Chuck Norris simply dropping his dick onto a piano keyboard.","Chuck Norris is so fast that he can use the earths rotation as a tredmill.","George Foreman has a Chuck Norris grill.","Chuck Norris eats steel and craps samurai swords, which he throws away because Chuck Norris dont need weapons for mass destruction","Charlie Sheen is Chuck Norris' lovechild.","Chuck Norris showers with a sand blaster.","Some people die even though they don't deserve to. None of them are killed by Chuck Norris. He kills those who damn well fucking deserve it.","Chuck Norris was expelled from the third grade for knocking up his teacher. For the second time.","The world used to be round o that when people go to the bottom of the Earth they fall off but then Chuck Norris stepped on a globe and its all flat and so it the world THANK YOU,CHUCK!","Chuck Norris owns the world's only working proton pack. He has used it once, to kill some noisy neighbours, then catch their souls.","Only Chuck Norris can prevent forest fires, but he really likes gigantic toasted marshmallows.","The ONLY Chuck Norris regret.... inventing Al Gore.","Chuck Norris was once in Russia, people now remember it as \"In Soviet Russia\"","Chuck Norris doesn't want to build a snowman.","Cancer gets Chuck Norris."]